2022-09-23-replace-vps-os-to-plan9.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="outline-container-org7edfab3" class="outline-2">
<h2 id="org7edfab3">use 9front replace vps&rsquo;s operating system</h2>
<div class="outline-text-2" id="text-org7edfab3">
<p>
You can test this blog on local virtual machine
</p>
</div>

<div id="outline-container-orge348704" class="outline-3">
<h3 id="orge348704">Need</h3>
<div class="outline-text-3" id="text-orge348704">
</div>
<div id="outline-container-org2acbcf7" class="outline-4">
<h4 id="org2acbcf7">out-of-band management console</h4>
<div class="outline-text-4" id="text-org2acbcf7">
<p>
Need a out-of-band management console to connect vps&rsquo;s screen
</p>
</div>
</div>

<div id="outline-container-org50f5f06" class="outline-4">
<h4 id="org50f5f06">kvm or bare metal</h4>
<div class="outline-text-4" id="text-org50f5f06">
<p>
OpenVZ or other container technology not discussed here
</p>
</div>
</div>
</div>

<div id="outline-container-orge86de5c" class="outline-3">
<h3 id="orge86de5c">Stage 0 boot a linux in RAM</h3>
<div class="outline-text-3" id="text-orge86de5c">
</div>
<div id="outline-container-org1169a43" class="outline-4">
<h4 id="org1169a43">Download iPXE image</h4>
<div class="outline-text-4" id="text-org1169a43">
<p>
MBR:
</p>

<div class="org-src-container">
<pre class="src src-shell"><code>wget http://boot.salstar.sk/ipxe/ipxe.usb  </code>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd5a3b8" class="outline-4">
<h4 id="orgbd5a3b8">Write iPXE image to disk</h4>
<div class="outline-text-4" id="text-orgbd5a3b8">
<div class="org-src-container">
<pre class="src src-shell"><code>sync # ensure data is sync to disk</code>
<code>dd if=ipxe.usb of=/dev/vda conv=sync # write image to harddisk</code>
<code>reboot -f # restart now</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ef1639" class="outline-4">
<h4 id="org9ef1639">use iPXE boot a linux in RAM</h4>
<div class="outline-text-4" id="text-org9ef1639">
<p>
now please connect vps&rsquo;s screen, use out-of-band management console
</p>

<p>
note: if vps privoder not have network autoconf, you may be need configure network manual
</p>

<p>
If it success, you now can seem a menu.
</p>

<p>
please select &rsquo;slackware&rsquo; to boot
</p>

<p>
if it failed:
</p>

<pre class="example">
<code>booting from Hard Disk...</code>
<code>iPXE initialising devices...ok</code>
<code></code>
<code></code>
<code></code>
<code>iPXE 1.21.1+ (g081b3) -- Open Source Network Boot Firmware -- https://ipxe.org</code>
<code>Features: DNS FTP HTTP HTTPS iSCSI TFTP SRP VLAN AoE ELF MBOOT PXE bzImage Menu </code>
<code>PXEXT</code>
<code></code>
<code>boot.salstar.sk - SAL's boot menu</code>
<code></code>
<code>Waiting for link-up on net0... ok</code>
<code>Configuring (net0 52:54:00:12:34:56)...... ok</code>
<code>IP: 10.0.2.15, netmask: 255.255.255.0, gateway: 10.0.2.2</code>
<code>Could not get time and date: Connection timed out (https://ipxe.org/4c496035)</code>
<code>https://boot.salstar.sk/by_mac/52:54:00:12:34:56... Network unreachable (https:/</code>
<code>/ipxe.org/280a6011)</code>
<code>https://boot.salstar.sk/by_ip/10.0.2.15... Network unreachable (https://ipxe.org</code>
<code>/280a6011)</code>
<code>https://boot.salstar.sk/menu.ipxe... Network unreachable (https://ipxe.org/280a6</code>
<code>011)</code>
<code>Press any key to enter failsafe menu ...</code>
</pre>

<p>
please press ENTER to start failsafe menu.
</p>

<p>
select &rsquo;Start iPXE shell&rsquo;
</p>

<p>
iPXE shell:
</p>

<pre class="example">
<code>iPXE&gt; </code>
</pre>

<p>
you can boot &rsquo;slackware&rsquo; by:
</p>

<pre class="example">
<code>kernel ftp://&lt;ip addr or domain name&gt;/slackware/slackware64-current/kernels/huge.s/bzImage</code>
<code>initrd ftp://&lt;ip addr or domain name&gt;/slackware/slackware64-current/isolinux/initrd.img</code>
<code>boot</code>
</pre>

<p>
note: if your dns not working, please use ip address instead domain name.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbe7072a" class="outline-3">
<h3 id="orgbe7072a">Stage 1 download 9front image and write to disk</h3>
<div class="outline-text-3" id="text-orgbe7072a">
</div>
<div id="outline-container-orgc12e15e" class="outline-4">
<h4 id="orgc12e15e">Download 9front image</h4>
<div class="outline-text-4" id="text-orgc12e15e">
<p>
use root login, then:
</p>

<div class="org-src-container">
<pre class="src src-shell"><code>dhcpcd eth0 # setup network</code>
<code>wget http://9front.org/iso/9front-&lt;version&gt;.amd64.iso.gz # download</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0722fc1" class="outline-4">
<h4 id="org0722fc1">write 9front image to disk</h4>
<div class="outline-text-4" id="text-org0722fc1">
<div class="org-src-container">
<pre class="src src-shell"><code>zcat 9front-&lt;version&gt;.amd64.iso.gz | dd bs=1M of=/dev/vda conv=sync # write</code>
<code>sync # ensure sync to disk</code>
<code>reboot # reboot</code>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcf630b8" class="outline-3">
<h3 id="orgcf630b8">Stage 2 install 9front</h3>
<div class="outline-text-3" id="text-orgcf630b8">
<p>
now you can install 9front.
</p>

<p>
but have some notice:
</p>
</div>

<div id="outline-container-orge8c0b21" class="outline-4">
<h4 id="orge8c0b21">configfs</h4>
<div class="outline-text-4" id="text-orge8c0b21">
<p>
if vps&rsquo;s disk size is small , please use hjfs.
</p>
</div>
</div>

<div id="outline-container-orge3e5db9" class="outline-4">
<h4 id="orge3e5db9">prepdisk</h4>
<div class="outline-text-4" id="text-orge3e5db9">
<p>
in prepdisk phases, you can&rsquo;t remove installation image&rsquo;s part.
</p>

<p>
safe method is create a new part in space outside the installation image
</p>

<pre class="example">
<code>If there is enough room, a Plan 9 partition will be</code>
<code>suggested; you can probably just type 'w' and then 'q'.</code>
<code></code>
<code>cylinder = 1048576 bytes</code>
<code>   empty                 0 463          (463 cylinders, 463.00 MB)</code>
<code>   * p1                  463 464        (1 cylinders, 1.00 MB) ESP</code>
<code>  '  p2                  464 4560       (4096 cylinders, 4.00 GB) PLAN9 # this is new part , outside of installation image</code>
<code>&gt;&gt;&gt; w</code>
<code>&gt;&gt;&gt; q</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb31b4b6" class="outline-3">
<h3 id="orgb31b4b6">All is done</h3>
<div class="outline-text-3" id="text-orgb31b4b6">
<p>
after installation, all is done, reboot your vps and use 9front!
</p>
</div>
</div>


<div id="outline-container-org260505b" class="outline-3">
<h3 id="org260505b">References</h3>
<div class="outline-text-3" id="text-org260505b">
<p>
<a href="http://boot.salstar.sk/">http://boot.salstar.sk/</a>
</p>

<p>
<a href="http://9front.org/releases/">http://9front.org/releases/</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last updated: 2023-06-28</p>
</div>
</body>
</html>
